tutorials/cfdemSolverRhoPimpleChem/Spreitzer_FluidBedCases/Spreitzer_R2/CFD/constant/foam.inp
species
(
        CO
        CO2
        H2
        H2O
	N2
);

reactions
{
}


