tutorials/cfdemSolverRhoPimpleChem/Spreitzer_FluidBedCases/Spreitzer_R2/CFD/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0      0         0)
    (0.06   0         0)
    (0.06   0.15      0)
    (0      0.15      0)
    (0      0      0.06)
    (0.06   0      0.06)
    (0.06   0.15   0.06)
    (0      0.15   0.06)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)(25 63 25) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    side-walls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 4 7 3)
            (2 6 5 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
