tutorials/cfdemSolverRhoPimpleChem/Spreitzer_FluidBedCases/Spreitzer_R2/CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    p
    {
        /*solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;*/
        solver          GAMG; 
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1; 
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }
    
    "(rho|G)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
        /*solver		smoothSolver;
        smoother	symGaussSeidel;
        tolerance	1e-6;
        relTol 		0.1;
        nSweeps		3;*/
    }
    
    "(rho|G)Final"
    {
	$rho;
        tolerance       1e-06;
        relTol          0;
    }
    
    "(U|h|R|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|h|R|k|epsilon)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }
    
    "(Yi|CO|CO2|H2|H2O|N2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
	maxIter		1;
    }

    "(Yi|CO|CO2|H2|H2O|N2)Final"
    {
        $Yi;
        tolerance       1e-06;
        relTol          0;
	maxIter		1;
    }
    
    T
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 3;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    rhoMin	rhoMin [ 1 -3 0 0 0 ] 0.5;
    rhoMax	rhoMax [ 1 -3 0 0 0 ] 2.5;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*"            0.9;
    }
}

// ************************************************************************* //
